# Pandas

`pandas` is very useful in building data with tabular structures. In other words, to work with datasets in Python.

The DataFrame is one of Pandas' most important data structures. It's basically a way to store tabular data where you can label the rows and the columns. 

In DataFrames, the raws correspond to the `observations` and the columns are the `variables`.

One way to build DataFrames manually is using dictionaires [link]

In [32]:
#import pandas
import pandas as pd

In [3]:
#Example

names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =  [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

my_dict = {'country':names,'drives_right':dr,'cars_per_cap':cpc}

# Build a DataFrame cars from my_dict
cars = pd.DataFrame(my_dict)

print(cars)

         country  drives_right  cars_per_cap
0  United States          True           809
1      Australia         False           731
2          Japan         False           588
3          India         False            18
4         Russia          True           200
5        Morocco          True            70
6          Egypt          True            45

To specify raw labels:

In [4]:
row_labels = ['US', 'AUS', 'JAP', 'IN', 'RU', 'MOR', 'EG']

cars.index=row_labels
print(cars)

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JAP          Japan         False           588
IN           India         False            18
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45

---------
Putting data in a dictionary and then building a DataFrame works, but it's not very efficient. What if you're dealing with millions of observations? In those cases, the data is typically available as files with a regular structure. One of those file types is the `CSV` file, which is short for "comma-separated values".

Simply use `pd.read_csv('PATH')`

In [33]:
zoo = pd.read_csv('zoo.csv')
print(zoo)

   Unnamed: 0    animal  uniq_id  water_need
0         an1  elephant     1001         500
1         an2  elephant     1002         600
2         an3  elephant     1003         550
3         an4     tiger     1004         300
4         an5     tiger     1005         320
5         an6     tiger     1006         330
6         an7     tiger     1007         290
7         an8     tiger     1008         310
8         an9     zebra     1009         200
9        an10     zebra     1010         220
10       an11     zebra     1011         240
11       an12     zebra     1012         230
12       an13     zebra     1013         220
13       an14     zebra     1014         100
14       an15     zebra     1015          80
15       an16      lion     1016         420
16       an17      lion     1017         600
17       an18      lion     1018         500
18       an19      lion     1019         390
19       an20  kangaroo     1020         410
20       an21  kangaroo     1021         430
21       an22  kangaroo     1022         410

Notice the first column in the DataFrame was not interpreted as raw index. To fix this we must tell pandas that the first col is a raw index.

In [47]:
zoo = pd.read_csv('zoo.csv',index_col=0)
print(zoo)

        animal  uniq_id  water_need
an1   elephant     1001         500
an2   elephant     1002         600
an3   elephant     1003         550
an4      tiger     1004         300
an5      tiger     1005         320
an6      tiger     1006         330
an7      tiger     1007         290
an8      tiger     1008         310
an9      zebra     1009         200
an10     zebra     1010         220
an11     zebra     1011         240
an12     zebra     1012         230
an13     zebra     1013         220
an14     zebra     1014         100
an15     zebra     1015          80
an16      lion     1016         420
an17      lion     1017         600
an18      lion     1018         500
an19      lion     1019         390
an20  kangaroo     1020         410
an21  kangaroo     1021         430
an22  kangaroo     1022         410

## Data Selection

### Column Access

In [7]:
zoo["water_need"]

an1     500
an2     600
an3     550
an4     300
an5     320
an6     330
an7     290
an8     310
an9     200
an10    220
an11    240
an12    230
an13    220
an14    100
an15     80
an16    420
an17    600
an18    500
an19    390
an20    410
an21    430
an22    410
Name: water_need, dtype: int64

In [8]:
type(zoo["water_need"])

pandas.core.series.Series

In [9]:
type(zoo[["water_need"]]) #double square to make a 
#sub-DataFrame

pandas.core.frame.DataFrame

In [10]:
#two columns selection

zoo[['animal','water_need']]

        animal  water_need
an1   elephant         500
an2   elephant         600
an3   elephant         550
an4      tiger         300
an5      tiger         320
an6      tiger         330
an7      tiger         290
an8      tiger         310
an9      zebra         200
an10     zebra         220
an11     zebra         240
an12     zebra         230
an13     zebra         220
an14     zebra         100
an15     zebra          80
an16      lion         420
an17      lion         600
an18      lion         500
an19      lion         390
an20  kangaroo         410
an21  kangaroo         430
an22  kangaroo         410

### Raw Access

In [11]:
zoo[1:4] #numbers to select raws

       animal  uniq_id  water_need
an2  elephant     1002         600
an3  elephant     1003         550
an4     tiger     1004         300

-------
## loc & iloc

**loc**

With `loc` and `iloc` you can do practically any data selection operation on DataFrames you can think of. `loc` is label-based, which means that you have to specify rows and columns based on their row and column labels. `iloc` is integer index based, so you have to specify rows and columns by their integer index.

`DataFrame.loc('raw_index')`

In [12]:
zoo.loc['an3'] #in our datafr

animal        elephant
uniq_id           1003
water_need         550
Name: an3, dtype: object

In [13]:
#to get a dataframe

zoo.loc[['an3']]

       animal  uniq_id  water_need
an3  elephant     1003         550

In [14]:
#muliple rows

zoo.loc[['an3','an5']]

       animal  uniq_id  water_need
an3  elephant     1003         550
an5     tiger     1005         320

**For rows and cols selection using `loc`**

In [15]:
#value selestion

zoo.loc['an3','water_need'] #[raw,col]

550

In [16]:
zoo.loc[['an3','an5'],['animal','water_need']]

       animal  water_need
an3  elephant         550
an5     tiger         320

In [17]:
# to select all rows and specific cols as series

zoo.loc[:,'animal']

an1     elephant
an2     elephant
an3     elephant
an4        tiger
an5        tiger
an6        tiger
an7        tiger
an8        tiger
an9        zebra
an10       zebra
an11       zebra
an12       zebra
an13       zebra
an14       zebra
an15       zebra
an16        lion
an17        lion
an18        lion
an19        lion
an20    kangaroo
an21    kangaroo
an22    kangaroo
Name: animal, dtype: object

In [18]:
# to select all rows and specific cols as dataframe
#(NOTE: 
#dataframe option provides multiple selection of the rows)

zoo.loc[:,['animal','water_need']]

        animal  water_need
an1   elephant         500
an2   elephant         600
an3   elephant         550
an4      tiger         300
an5      tiger         320
an6      tiger         330
an7      tiger         290
an8      tiger         310
an9      zebra         200
an10     zebra         220
an11     zebra         240
an12     zebra         230
an13     zebra         220
an14     zebra         100
an15     zebra          80
an16      lion         420
an17      lion         600
an18      lion         500
an19      lion         390
an20  kangaroo         410
an21  kangaroo         430
an22  kangaroo         410

------
**iloc**

it takes indexs (integers) to locate the rows and cols

In [19]:
zoo.iloc[2] #series

animal        elephant
uniq_id           1003
water_need         550
Name: an3, dtype: object

In [20]:
zoo.iloc[[2]] #dataframe

       animal  uniq_id  water_need
an3  elephant     1003         550

In [21]:
#mulitple rows
zoo.iloc[[1,2,3]]

       animal  uniq_id  water_need
an2  elephant     1002         600
an3  elephant     1003         550
an4     tiger     1004         300

In [22]:
#value selection
zoo.iloc[1,2]

600

In [23]:
#raws and cols
zoo.iloc[[1,2,3],[0,1]]

       animal  uniq_id
an2  elephant     1002
an3  elephant     1003
an4     tiger     1004

In [24]:
#all rows and selected cols
zoo.iloc[:,[0,1]]

        animal  uniq_id
an1   elephant     1001
an2   elephant     1002
an3   elephant     1003
an4      tiger     1004
an5      tiger     1005
an6      tiger     1006
an7      tiger     1007
an8      tiger     1008
an9      zebra     1009
an10     zebra     1010
an11     zebra     1011
an12     zebra     1012
an13     zebra     1013
an14     zebra     1014
an15     zebra     1015
an16      lion     1016
an17      lion     1017
an18      lion     1018
an19      lion     1019
an20  kangaroo     1020
an21  kangaroo     1021
an22  kangaroo     1022

---------
# Filtering in Pandas

In [25]:
zoo #complete dataset

        animal  uniq_id  water_need
an1   elephant     1001         500
an2   elephant     1002         600
an3   elephant     1003         550
an4      tiger     1004         300
an5      tiger     1005         320
an6      tiger     1006         330
an7      tiger     1007         290
an8      tiger     1008         310
an9      zebra     1009         200
an10     zebra     1010         220
an11     zebra     1011         240
an12     zebra     1012         230
an13     zebra     1013         220
an14     zebra     1014         100
an15     zebra     1015          80
an16      lion     1016         420
an17      lion     1017         600
an18      lion     1018         500
an19      lion     1019         390
an20  kangaroo     1020         410
an21  kangaroo     1021         430
an22  kangaroo     1022         410

Lets say you want to filter the `water_need` to greater than 300.

* First select the columns that are greater than 300
* Then do the comparison on the col (get a series)
* Then apply the comparison to the dataset

In [26]:
zoo["water_need"]

an1     500
an2     600
an3     550
an4     300
an5     320
an6     330
an7     290
an8     310
an9     200
an10    220
an11    240
an12    230
an13    220
an14    100
an15     80
an16    420
an17    600
an18    500
an19    390
an20    410
an21    430
an22    410
Name: water_need, dtype: int64

In [27]:
zoo["water_need"]>300

an1      True
an2      True
an3      True
an4     False
an5      True
an6      True
an7     False
an8      True
an9     False
an10    False
an11    False
an12    False
an13    False
an14    False
an15    False
an16     True
an17     True
an18     True
an19     True
an20     True
an21     True
an22     True
Name: water_need, dtype: bool

In [28]:
need_water = zoo["water_need"]>300
zoo[need_water]

#now it is filtered to water_need>300 raws

        animal  uniq_id  water_need
an1   elephant     1001         500
an2   elephant     1002         600
an3   elephant     1003         550
an5      tiger     1005         320
an6      tiger     1006         330
an8      tiger     1008         310
an16      lion     1016         420
an17      lion     1017         600
an18      lion     1018         500
an19      lion     1019         390
an20  kangaroo     1020         410
an21  kangaroo     1021         430
an22  kangaroo     1022         410

In [31]:
#greater than 300 less than 400
import numpy as np

condition = np.logical_and(zoo["water_need"]>300,zoo["water_need"]<400)

zoo[condition]

     animal  uniq_id  water_need
an5   tiger     1005         320
an6   tiger     1006         330
an8   tiger     1008         310
an19   lion     1019         390

--------
## Looping over pandas databasis

In [37]:
for val in zoo:
    print(val)

animal
uniq_id
water_need

That's interesting! We are getting the col names. To loop over the rows:

**iterrows()**

In [39]:
for lab,row in zoo.iterrows(): #label of the row, row data
    print(lab)
    print(row) #series of the row

an1
animal        elephant
uniq_id           1001
water_need         500
Name: an1, dtype: object
an2
animal        elephant
uniq_id           1002
water_need         600
Name: an2, dtype: object
an3
animal        elephant
uniq_id           1003
water_need         550
Name: an3, dtype: object
an4
animal        tiger
uniq_id        1004
water_need      300
Name: an4, dtype: object
an5
animal        tiger
uniq_id        1005
water_need      320
Name: an5, dtype: object
an6
animal        tiger
uniq_id        1006
water_need      330
Name: an6, dtype: object
an7
animal        tiger
uniq_id        1007
water_need      290
Name: an7, dtype: object
an8
animal        tiger
uniq_id        1008
water_need      310
Name: an8, dtype: object
an9
animal        zebra
uniq_id        1009
water_need      200
Name: an9, dtype: object
an10
animal        zebra
uniq_id        1010
water_need      220
Name: an10, dtype: object
an11
animal        zebra
uniq_id        1011
water_need      240
Name: an11, dtype: object
an12
animal        zebra
uniq_id        1012
water_need      230
Name: an12, dtype: object
an13
animal        zebra
uniq_id        1013
water_need      220
Name: an13, dtype: object
an14
animal        zebra
uniq_id        1014
water_need      100
Name: an14, dtype: object
an15
animal        zebra
uniq_id        1015
water_need       80
Name: an15, dtype: object
an16
animal        lion
uniq_id       1016
water_need     420
Name: an16, dtype: object
an17
animal        lion
uniq_id       1017
water_need     600
Name: an17, dtype: object
an18
animal        lion
uniq_id       1018
water_need     500
Name: an18, dtype: object
an19
animal        lion
uniq_id       1019
water_need     390
Name: an19, dtype: object
an20
animal        kangaroo
uniq_id           1020
water_need         410
Name: an20, dtype: object
an21
animal        kangaroo
uniq_id           1021
water_need         430
Name: an21, dtype: object
an22
animal        kangaroo
uniq_id           1022
water_need         410
Name: an22, dtype: object

To print out the label of the row along with the row's value in a specific column:

In [42]:
for lab,row in zoo.iterrows():
    print(lab+": "+str(row["water_need"]))

an1: 500
an2: 600
an3: 550
an4: 300
an5: 320
an6: 330
an7: 290
an8: 310
an9: 200
an10: 220
an11: 240
an12: 230
an13: 220
an14: 100
an15: 80
an16: 420
an17: 600
an18: 500
an19: 390
an20: 410
an21: 430
an22: 410

**Example:** Add a new col in the dataset that defines the number of characters in each aminal's name!

In [44]:
for lab,row in zoo.iterrows():
    zoo.loc[lab, "name_length"] = len(row["animal"])
print(zoo)

        animal  uniq_id  water_need  name_length
an1   elephant     1001         500          8.0
an2   elephant     1002         600          8.0
an3   elephant     1003         550          8.0
an4      tiger     1004         300          5.0
an5      tiger     1005         320          5.0
an6      tiger     1006         330          5.0
an7      tiger     1007         290          5.0
an8      tiger     1008         310          5.0
an9      zebra     1009         200          5.0
an10     zebra     1010         220          5.0
an11     zebra     1011         240          5.0
an12     zebra     1012         230          5.0
an13     zebra     1013         220          5.0
an14     zebra     1014         100          5.0
an15     zebra     1015          80          5.0
an16      lion     1016         420          4.0
an17      lion     1017         600          4.0
an18      lion     1018         500          4.0
an19      lion     1019         390          4.0
an20  kangaroo     1020         410          8.0
an21  kangaroo     1021         430          8.0
an22  kangaroo     1022         410          8.0

The looping method above the count the length of each string in each raw in very inefficinet especially if the data is so bulky. An alternative way is using **`apply`**

In [48]:
zoo["animal_length"] = zoo["animal"].apply(len)

In [49]:
zoo

        animal  uniq_id  water_need  animal_length
an1   elephant     1001         500              8
an2   elephant     1002         600              8
an3   elephant     1003         550              8
an4      tiger     1004         300              5
an5      tiger     1005         320              5
an6      tiger     1006         330              5
an7      tiger     1007         290              5
an8      tiger     1008         310              5
an9      zebra     1009         200              5
an10     zebra     1010         220              5
an11     zebra     1011         240              5
an12     zebra     1012         230              5
an13     zebra     1013         220              5
an14     zebra     1014         100              5
an15     zebra     1015          80              5
an16      lion     1016         420              4
an17      lion     1017         600              4
an18      lion     1018         500              4
an19      lion     1019         390              4
an20  kangaroo     1020         410              8
an21  kangaroo     1021         430              8
an22  kangaroo     1022         410              8

In [51]:
#capitalize the animals name

zoo["ANIMAL"] = zoo["animal"].apply(str.upper)

zoo

        animal  uniq_id  water_need  animal_length    ANIMAL
an1   elephant     1001         500              8  ELEPHANT
an2   elephant     1002         600              8  ELEPHANT
an3   elephant     1003         550              8  ELEPHANT
an4      tiger     1004         300              5     TIGER
an5      tiger     1005         320              5     TIGER
an6      tiger     1006         330              5     TIGER
an7      tiger     1007         290              5     TIGER
an8      tiger     1008         310              5     TIGER
an9      zebra     1009         200              5     ZEBRA
an10     zebra     1010         220              5     ZEBRA
an11     zebra     1011         240              5     ZEBRA
an12     zebra     1012         230              5     ZEBRA
an13     zebra     1013         220              5     ZEBRA
an14     zebra     1014         100              5     ZEBRA
an15     zebra     1015          80              5     ZEBRA
an16      lion     1016         420              4      LION
an17      lion     1017         600              4      LION
an18      lion     1018         500              4      LION
an19      lion     1019         390              4      LION
an20  kangaroo     1020         410              8  KANGAROO
an21  kangaroo     1021         430              8  KANGAROO
an22  kangaroo     1022         410              8  KANGAROO